Revit 2026 API

# DimensionAbove Property

---

The text shown above the segment's value.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string Above { get; set; }
```
```vb
Public Property Above As String
	Get
	Set
```
```cpp
public:
property String^ Above {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member Above : string with get, set
```

#### Property Value

String

This property is for use with single-segmment dimensions only. For multi-segment dimensions use the corresponding properties of the DimensionSegment class.

#### Reference

Dimension Class

Autodesk.Revit.DB Namespace